---
kind: property
id: P:Autodesk.Revit.DB.TessellatedShapeBuilder.Target
source: html/2e6f38a0-cabd-5fac-34dc-40af993135c7.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilder.Target Property

Requests the type of geometry to be built.

## Syntax (C#)
```csharp
public TessellatedShapeBuilderTarget Target { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration